START_PHRASE = "Привет! Я буду проверять ваши знания в совершенно разных сферах: " \
               "от ментальной арифметики и интеллектуальных задач до поговорок и столиц разных стран.\n" \
               "Со мной вы точно не соскучитесь - вам частенько придется хорошенько подумать перед ответом. " \
               "В любой момент вы можете попросить меня озвучить вашу статистику." \
               "Теперь самое время выбрать тип задач:"

START_MENTALLY_MATH = "Ого! Любите математику? Ну что ж, самое время проверить ваши навыки устного счета! " \
                      "Я буду давать вам несложные примеры, а вы должны их решить. Все просто! " \
                      "Думаю, для начала дам вам совсем простые."

START_CAPITALS = "География была бы моим любимым предметом, если бы я училась в школе. Ха-ха! " \
                 "Поэтому предлагаю сыграть в небольшую угадайку. Все просто: я называю вам столицу, а вы угадываете страну. "

START_TRANSLATOR = "Английский явно не мой конёк. Но что-то я в нем всё-таки смыслю. " \
                   "Я буду диктовать вам фразы или слова на одном языке, а вы должны перевести их на другой."

HELP_PHRASE = ""

CONTINUE_PROBLEMS = "Я смотрю вы снова решил испытать свои интеллектуальные способности! " \
                    "Хорошо... давайте попробуем!"

CORRECT_ANSWERS_MATH = [("Это правильный ответ. Идем дальше",), ("Вы молодец. Давайте решим новый пример!",),
                        ("Ваши интелектуальные способности на высоте. Решите новый пример?",)]
INCORRECT_ANSWERS_MATH = [("Упс. Правильный ответ - ",), ("Мне самой трудно дается математика. Верный ответ - ",)]
CONGRATULATIONS_PHRASES = [("Да, это ",), ("Вы молодец это . Попробуйте еще один пример",), ("Так держать это ",),
                           ("Вижу вы преуспели, давайте попробуем еще ",)]
LOSE_PHRASES = [("Упс!",), ("Эх!",), ("Как так!",)]
STOP_GAME_PHRASES = [("Алиса хватит",), ("Хватит",), ("Алиса стоп",), ("Алиса хватит",), ("Отмена",),
                     ("Закончить сессию",), ("Стоп",), ("Выход",), ("Алиса выход",), ("Алиса выйди отсюда пожалуйста",),
                     ("Алиса я устал",), ("Я устал",), ("На сегодня хватит",), ("Алиса на сегодня хватит",),
                     ("Алиса я пойду отдохнуть",), ("Я пойду отдохну",)]
CORRECT_ANSWERS_CAPITALS = [("Да, это ",), ("Верно, это ",)]
HELP_PHRASES = [("помощь",), ("правила",), ("помоги",), ("алиса помоги",), ("Алиса мне нужна помощь",),
                ("Алиса мне нужна твоя помощь",), ("помощь",)]
ATTEMPTS_PHRASES = [("Неверно. Попробуйте еще раз.",), ("Это тяжело но я в вас верю. Попробуйте еще раз.",)]
NEXT_PHRASES = [("Попробуйте новое задание!",), ("Давайте выполним еще одно задание",),
                ("Укрепим материал новым заданием",), ("Сделайте еще один пример",)]
