START_PHRASE = "Привет! Я буду проверять ваши знания в совершенно разных сферах: " \
               "от ментальной арифметики и интеллектуальных задач до поговорок и столиц разных стран.\n" \
               "Со мной вы точно не соскучитесь - вам частенько придется хорошенько подумать перед ответом. " \
               "В любой момент вы можете попросить меня озвучить вашу статистику." \
               "Теперь самое время выбрать тип задач:"

START_MENTALLY_MATH = "Ого! Любите математику? Ну что ж, самое время проверить ваши навыки устного счета! " \
                      "Я буду давать вам несложные примеры, а вы должны их решить. Все просто! " \
                      "Думаю, для начала дам вам совсем простые."

START_CAPITALS = "География была бы моим любимым предметом, если бы я училась в школе. Ха-ха! " \
                 "Поэтому предлагаю сыграть в небольшую угадайку. Все просто: я называю вам столицу, а вы угадываете страну. "

START_TRANSLATOR = "Английский явно не мой конёк. Но что-то я в нем всё-таки смыслю. " \
                   "Я буду диктовать вам фразы или слова на одном языке, а вы должны перевести их на другой."

START_PROBLEMS = "Я не сильна в интеллектуальных задачах, поэтому сегодня вы решаете вместо меня! " \
                 'Правила игры "Что?Где?Когда?": с меня вопрос , с вас ответ. Принимается ответ в одно или фраза из двух слов.'

CONTINUE_PROBLEMS = "Я смотрю вы снова решил испытать свои интеллектуальные способности! " \
                    "Хорошо... давайте попробуем!"

CORRECT_ANSWERS_MATH = ["Это правильный ответ. Идем дальше"]
INCORRECT_ANSWERS_MATH = ["Упс. Правильный ответ - "]
CONGRATULATIONS_PHRASES = ["Да, это "]
LOSE_PHRASES = ["Упс!"]
STOP_GAME_PHRASES = []
CORRECT_ANSWERS_CAPITALS = ["Да, это "]
HELP_PHRASES = ["помощь", "правила"]
ATTEMPTS_PHRASES = ["Неверно. Попробуйте еще раз."]

