START_PHRASE = "Привет! Я буду проверять ваши знания в " \
               "совершенно разных сферах: " \
               "от ментальной арифметики и интеллектуальных " \
               "задач до поговорок и столиц разных стран.\n" \
               "Со мной вы точно не соскучитесь - " \
               "вам частенько придется хорошенько подумать перед ответом. " \
               "Теперь самое время выбрать тип задач:"

START_MENTALLY_MATH = "Ого! Любите математику? Ну что ж, " \
                      "самое время проверить ваши навыки устного счета! " \
                      "Я буду давать вам несложные примеры, " \
                      "а вы должны их решить. Все просто! " \
                      "Думаю, для начала дам вам совсем простые."

START_CAPITALS = "География была бы моим любимым предметом, " \
                 "если бы я училась в школе. Ха-ха! " \
                 "Поэтому предлагаю сыграть в небольшую угадайку. " \
                 "Все просто: я называю вам столицу, а вы угадываете страну. "

START_TRANSLATOR = "Английский явно не мой конёк, " \
                   "но что-то я в нем всё-таки смыслю. " \
                   "Я буду диктовать вам фразы или слова на одном языке, " \
                   "а вы должны перевести их на другой."

HELP_PHRASE = 'Что бы узнать что я умею напишите "Что ты умеешь?", ' \
              'что бы изменить режим напишите "Режим",' \
              'что бы прекратить учёбу напишите "Выход"'

CONTINUE_PROBLEMS = "Я смотрю вы снова решил испытать " \
                    "свои интеллектуальные способности! " \
                    "Хорошо, давайте попробуем!"

CORRECT_ANSWERS_MATH = [("Это правильный ответ. Идем дальше",),
                        ("Вы молодец. Давайте решим новый пример!",),
                        (
                            "Ваши интеллектуальные способности на высоте. "
                            "Решите новый пример?",)]
INCORRECT_ANSWERS_MATH = [("Упс. Правильный ответ - ",), (
    "Мне самой трудно дается математика. Верный ответ - ",)]
CONGRATULATIONS_PHRASES = [("Да, это ",),
                           ("Вы молодец это . Попробуйте еще один пример",),
                           ("Так держать это ",),
                           ("Вижу вы преуспели, давайте попробуем еще ",)]
LOSE_PHRASES = [("Упс!",), ("Эх!",), ("Как так!",)]
STOP_GAME_PHRASES = [("хватит",), ("стоп",), ("отмена",), ("закончить",),
                     ("выход",), ("устал",), ("хватит",), ('харе',)]
CORRECT_ANSWERS_CAPITALS = [("Да, это ",), ("Верно, это ",)]
HELP_PHRASES = [("помощь",), ("правила",), ("помоги",)]
ATTEMPTS_PHRASES = [("Неверно. Попробуйте еще раз.",),
                    ("Это тяжело но я в вас верю. Попробуйте еще раз.",)]
NEXT_PHRASES = [("Попробуйте новое задание!",),
                ("Давайте выполним еще одно задание",),
                ("Укрепим материал новым заданием",),
                ("Сделайте еще один пример",)]

WHAT_CAN_YOU_DO_PHRASE = 'Я могу вас научить многому, например: \n' \
                         'математике с помощью команды ' \
                         '"Ментальная Арифметика", \n' \
                         'английскому языку - "Перевод слов", \n' \
                         'географии - "Столицы государств", \n' \
                         'поговорки - "Изучение поговорок"'

GREETING_AGAIN = 'Я снова рада вас видеть! Что хотите попробовать на этот раз?'

MENTALLY_MATH_AGAIN = 'Я вижу вам понравились мои примеры. ' \
                      'Давайте порешаем еще.'

TRANSLATOR_AGAIN = 'Решили снова пополнить словарный запас? ' \
                   'Давайте поучим новые слова.'

SOMETHING_WRONG = "Ой! Кажется что-то пошло не так!"

START_PROVERB = 'Вы знали что с помощью поговорок можно многократно ' \
                'улучшить свою речь и сделать ее более грамотной. ' \
                'Я буду говорить вам первую часть поговорок, ' \
                'а вторую вы должны закончить сами. Не бойтесь ошибиться, ' \
                'я сама первое время плохо их знала, у вас все получится.'

PROVERB_AGAIN = 'Хотите еще подучить новых поговорок? ' \
                'Давайте вместе займемся этим!'
